In [2]:
import pandas as pd

In [4]:
attacks = pd.read_csv("./data/attacks.csv", encoding="latin1")
attacks.head()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,...,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.08,2018.06.08,6300.0,NaN,NaN
4,2018.06.04,04-Jun-2018,2018.0,Provoked,MEXICO,Colima,La Ticla,Free diving,Gustavo Ramos,M,...,"Tiger shark, 3m",A .Kipper,2018.06.04-Ramos.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.04,2018.06.04,6299.0,NaN,NaN

In [6]:
attacks.shape #the dataframe has 25723 rows and 24 columns

(25723, 24)

In [29]:
attacks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

In [19]:
attacks.isnull().sum()

Case Number               17021
Date                      19421
Year                      19423
Type                      19425
Country                   19471
Area                      19876
Location                  19961
Activity                  19965
Name                      19631
Sex                       19986
Age                       22252
Injury                    19449
Fatal (Y/N)               19960
Time                      22775
Species                   22259
Investigator or Source    19438
pdf                       19421
href formula              19422
href                      19421
Case Number.1             19421
Case Number.2             19421
original order            19414
Unnamed: 22               25722
Unnamed: 23               25721
dtype: int64

In [41]:
attacks.duplicated().sum()

19411

In [28]:
attacks.describe()

              Year  original order
count  6300.000000     6309.000000
mean   1927.272381     3155.999683
std     281.116308     1821.396206
min       0.000000        2.000000
25%    1942.000000     1579.000000
50%    1977.000000     3156.000000
75%    2005.000000     4733.000000
max    2018.000000     6310.000000

In [9]:
attacks.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [27]:
attacks['Sex '].value_counts()

M      5094
F       637
M         2
N         2
lli       1
.         1
Name: Sex , dtype: int64

In [58]:
attacks['Type'].value_counts()

Unprovoked      4595
Provoked         574
Invalid          547
Sea Disaster     239
Boating          203
Boat             137
Questionable       2
Boatomg            1
Name: Type, dtype: int64

In [84]:
subset = attacks[["Type", "Activity", "Injury", 'Fatal (Y/N)']]
subset

,Type,Activity,Injury,Fatal (Y/N)
0,Boating,Paddling,"No injury to occupant, outrigger canoe and pad...",N
1,Unprovoked,Standing,Minor injury to left thigh,N
2,Invalid,Surfing,Injury to left lower leg from surfboard skeg,N
3,Unprovoked,Surfing,Minor injury to lower leg,N
4,Provoked,Free diving,Lacerations to leg & hand shark PROVOKED INCIDENT,N
...,...,...,...,...
25718,NaN,NaN,NaN,NaN
25719,NaN,NaN,NaN,NaN
25720,NaN,NaN,NaN,NaN
25721,NaN,NaN,NaN,NaN
25722,NaN,NaN,NaN,NaN

In [79]:
condition1 = subset["Type"] == "Provoked"
condition2 = subset["Fatal (Y/N)"] == "Y"
subset[condition1 & condition2]

          Type                                           Activity Fatal (Y/N)
473   Provoked                                            Fishing           Y
1090  Provoked                                                NaN           Y
1554  Provoked                            Removing shark from net           Y
1843  Provoked                                      Shark Fishing           Y
3601  Provoked  Fishing from 34' boat when pulled overboard by...           Y
3891  Provoked                     Fishing (trolling)  from canoe           Y
4005  Provoked  Fishing, hooked shark towed boat out to sea, s...           Y
4240  Provoked         Attempting to kill a shark with explosives           Y
4241  Provoked         Attempting to kill a shark with explosives           Y
4245  Provoked                             Floating in inner tube           Y
4403  Provoked                                            Fishing           Y
4999  Provoked                                            Fishing           Y
5299  Provoked          Fishing, attempted to take a netted shark           Y
5570  Provoked                                     Hunting sharks           Y
5685  Provoked                                       Dress diving           Y
5774  Provoked                                                NaN           Y
6131  Provoked                    Standing on landed shark's tail           Y
6134  Provoked                                            Fishing           Y
6254  Provoked                   Shark fishing, knocked overboard           Y

In [53]:
attacks['Year'].value_counts()

2015.0    143
2017.0    136
2016.0    130
2011.0    128
2014.0    127
         ...
1786.0      1
1785.0      1
1784.0      1
1783.0      1
1815.0      1
Name: Year, Length: 249, dtype: int64

In [81]:
subset_1 = attacks[["Country", "Area", 'Location']]
subset_1

         Country             Area                        Location
0            USA       California     Oceanside, San Diego County
1            USA          Georgia  St. Simon Island, Glynn County
2            USA           Hawaii                    Habush, Oahu
3      AUSTRALIA  New South Wales              Arrawarra Headland
4         MEXICO           Colima                        La Ticla
...          ...              ...                             ...
25718        NaN              NaN                             NaN
25719        NaN              NaN                             NaN
25720        NaN              NaN                             NaN
25721        NaN              NaN                             NaN
25722        NaN              NaN                             NaN

[25723 rows x 3 columns]

In [ ]:
#In what Countries and month are there more shark attacks?
# What is the most common injury among surfers/people surfing attacked by sharks?
#
#BONUS: What were doing the people that died while provoking shark attacks?